master/cases/sydney/case/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "4.98";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.233;

boundaryField
{
    nozzle
    {
        type            fixedValue;
        value           uniform 0.223;
    }
    coflow
    {
        type            fixedValue;
        value           uniform 0.233;
    }
    walls
    {
        type            zeroGradient;
    }
    front
    {
        type            wedge;
    }
    back
    {
		type			wedge;
	}
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
