master/cases/sydney/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "10000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
14800
(
(29.5288 0.000730138 -5.38012e-15)
(29.5256 0.00108816 -8.67185e-14)
(29.512 0.00155743 -1.64145e-13)
(29.4932 0.00185908 -1.96989e-12)
(29.4722 0.00203409 -1.03459e-12)
(29.4495 0.00214772 -1.8145e-13)
(29.4255 0.00221765 1.03068e-11)
(29.4007 0.00225456 2.46661e-12)
...
)
;

boundaryField
{
    nozzle
    {
        type            timeVaryingMappedFixedValue;
        setAverage      0;
        value           nonuniform List<vector> 
24
(
(29.5367 0 0)
(29.5144 0 0)
(29.4679 0 0)
(29.3952 0 0)
(29.2979 0 0)
(29.1756 0 0)
(29.0258 0 0)
(28.847 0 0)
...
)
;
    }
    coflow
    {
        type            fixedValue;
        value           uniform (3 0 0);
    }
    walls
    {
        type            zeroGradient;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
