master/cases/sydney/case/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
14800
(
2.79525
2.79547
2.79562
2.79574
2.79583
2.79591
2.79598
2.79605
...
)
;

boundaryField
{
    nozzle
    {
        type            timeVaryingMappedFixedValue;
        setAverage      0;
        value           nonuniform List<scalar> 
24
(
2.79482
2.81438
2.85504
2.9178
3.00052
3.10284
3.22517
3.36713
...
)
;
    }
    coflow
    {
        type            fixedValue;
        value           uniform 0.0018;
    }
    walls
    {
        type            compressible::kqRWallFunction;
        value           nonuniform List<scalar> 
200
(
0.00179668
0.00179328
0.00178981
0.00178628
0.00178268
0.00177902
0.00177531
0.00177154
...
)
;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
