master/cases/sydney/case/0/mut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      mut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
14800
(
0.00104222
0.00104211
0.00104201
0.00104192
0.00104183
0.00104176
0.00104169
0.00104163
...
)
;

boundaryField
{
    nozzle
    {
        type            calculated;
        value           nonuniform List<scalar> 
24
(
0.00104231
0.00103878
0.00103166
0.00102114
0.00100819
0.000993382
0.000976838
0.000958637
...
)
;
    }
    coflow
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
3.40093e-07
3.401e-07
3.40104e-07
3.40107e-07
3.40109e-07
3.4011e-07
3.40111e-07
3.40112e-07
...
)
;
    }
    walls
    {
        type            mutWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
74
(
0.00484151
0.00484075
0.0048392
0.00483696
0.00483404
0.00483044
0.00482616
0.00482123
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
