master/cases/sydney/case/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "1800";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
29326
(
5.4899e-08
4.1196e-12
5.48915e-08
7.51567e-12
5.4882e-08
9.45954e-12
5.48721e-08
9.91337e-12
...
)
;

boundaryField
{
    nozzle
    {
        type            calculated;
        value           nonuniform List<scalar> 
24
(
-5.49031e-08
-1.64709e-07
-2.74516e-07
-3.84322e-07
-4.94128e-07
-6.03934e-07
-7.1374e-07
-8.23546e-07
...
)
;
    }
    coflow
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-4.11684e-07
-4.58933e-07
-5.11648e-07
-5.70467e-07
-6.36101e-07
-7.09345e-07
-7.91085e-07
-8.82312e-07
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
-2.23902e-10
-9.61152e-10
-1.74154e-09
-2.56441e-09
-3.42974e-09
-4.33771e-09
-5.28913e-09
-6.28493e-09
...
)
;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
74
(
6.43086e-09
1.92934e-08
3.21587e-08
4.50286e-08
5.79047e-08
7.07891e-08
8.36835e-08
9.659e-08
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
