master/cases/sydney/case/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1800";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
14800
(
1.25936
1.25936
1.25936
1.25936
1.25936
1.25937
1.25937
1.25937
...
)
;

boundaryField
{
    nozzle
    {
        type            calculated;
        value           nonuniform List<scalar> 
24
(
1.25936
1.25936
1.25936
1.25936
1.25936
1.25936
1.25936
1.25936
...
)
;
    }
    coflow
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
1.16623
1.16628
1.16631
1.16633
1.16634
1.16635
1.16636
1.16636
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
1.1664
1.1664
1.1664
1.1664
1.1664
1.1664
1.1664
1.1664
...
)
;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
74
(
1.16639
1.16639
1.16639
1.16639
1.16639
1.16639
1.16639
1.16639
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
