master/cases/sydney/case/0/y
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      y;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
17000
(
0.0747654
0.0747654
0.0747654
0.0747654
0.0747654
0.0747654
0.0747654
0.0747654
...
)
;

boundaryField
{
    nozzle
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
0.0747661
0.0745486
0.0743092
0.0740668
0.0738233
0.0735794
0.0733352
0.0730908
0.0728464
0.0726019
0.0723573
0.0721127
0.0718681
0.0716235
0.0713788
0.0711341
0.0708894
0.0706448
0.0704001
0.0701553
)
;
    }
    coflow
    {
        type            calculated;
        value           nonuniform List<scalar> 
65
(
0.0699183
0.069682
0.0694323
0.0691683
0.0688894
0.0685947
0.0682832
0.067954
...
)
;
    }
    walls
    {
        type            calculated;
        value           uniform 1e-15;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
85
(
0.0748335
0.0746162
0.074377
0.0741348
0.0738916
0.0736479
0.0734039
0.0731598
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
