master/cases/sydney/case/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\ 
| =========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  1.4                                   | 
|   \  /    A nd           | Web:      http://www.openfoam.org               | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 

FoamFile 
{    version         2.0; 
    format          ascii; 

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary; 
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1;

vertices (
	(0 0 0)
	(0 0.00489533628575 -0.00021373499809)
	(0.5 0.00489533628575 -0.00021373499809)
	(0.5 0 0)
	(0 0.00489533628575 0.00021373499809)
	(0.5 0.00489533628575 0.00021373499809)
	(0 0.0749286166186 -0.0032714540524)
	(0.5 0.0749286166186 -0.0032714540524)
	(0 0.0749286166186 0.0032714540524)
	(0.5 0.0749286166186 0.0032714540524)
);

 blocks (
	 hex (0 3 2 1 0 3 5 4) (200 24 1) simpleGrading (10 1 1)
	 hex (1 2 7 6 4 5 9 8) (200 50 1) simpleGrading (10 15 1)
);

edges (
	 arc 1 4 (0 0.0049 0)
	 arc 2 5 (0.5 0.0049 0)
	 arc 6 8 (0 0.075 0)
	 arc 7 9 (0.5 0.075 0)
);

patches
(
	 patch nozzle (
		 (0 4 1 0)
	 )
	 patch coflow (
		 (1 4 8 6)
	 )
	 wall walls (
		 (6 8 9 7)
	 )
	 wedge back (
		 (0 1 2 3)
		 (1 6 7 2)
	 )
	 wedge front (
		 (0 3 5 4)
		 (4 5 9 8)
	 )
	 patch outlet (
		 (3 2 5 3)
		 (5 2 7 9)
	 )
);

 mergePatchPairs
(
);

// ************************************************************************* // 
