master/cases/sydney/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    nozzle
    {
        type            patch;
        nFaces          24;
        startFace       29326;
    }
    coflow
    {
        type            patch;
        nFaces          50;
        startFace       29350;
    }
    walls
    {
        type            wall;
        nFaces          200;
        startFace       29400;
    }
    back
    {
        type            wedge;
        nFaces          14800;
        startFace       29600;
    }
    front
    {
        type            wedge;
        nFaces          14800;
        startFace       44400;
    }
    outlet
    {
        type            patch;
        nFaces          74;
        startFace       59200;
    }
    defaultFaces
    {
        type            empty;
        nFaces          0;
        startFace       59274;
    }
)

// ************************************************************************* //
